"""
# -*- coding: utf-8 -*-
# @File    : demo.py
# @Time    : 2020/11/25 10:26 上午
# @Author  : xiaolu
# @Email   : luxiaonlp@163.com
# @Software: PyCharm
"""
# 安装 pip install ahocorasick -i https://pypi.douban.com/simple
import ahocorasick


if __name__ == '__main__':
    wordlist = ['长春海外制药接骨续筋片', '香菇炖甲鱼', '三鹤药业黄柏胶囊', '上海衡山熊去氧胆酸片', '升和药业依托泊苷注射液', '怡诺思',
                  '人格障碍', '转铁蛋白饱和度', '脾囊肿', '素烧白萝卜', '利君现代冠脉宁片', '上海复华药业注射用还原型谷', '阴囊上有白色小疙瘩',
                  '腹痛伴休克', '成都通德胰激肽原酶肠溶片', '蒸猪肝', '河北百善血尿胶囊', '精神障碍', '输卵管畸形', '元和抑眩宁胶囊', '莲藕豆腐',
                  '辰欣哈西奈德溶液', '信谊烟酸片', '慢性胆囊炎', '参芪降糖颗粒', '康普药业盐酸普萘洛尔片', '西安迪赛胸腺肽肠溶片',
                  '双鹭药业注射用复合辅酶', '慢性筛窦炎', '新高制药维胺酯维E乳膏', '冰黄肤乐软膏', '神经类疾病', '液晶热图',
                  '枣（干）', '股外侧皮神经病', '浙江惠松硅炭银片', '牙根外露', '湖北潜江氯霉素滴眼液', '盐类皮质激素分泌过多', '五子衍宗丸',
                  '小儿阵发性睡眠性血红蛋白尿症', '功能失调性子宫出血病', '茵栀黄口服液', '眼底出血和渗出', '斯达制药注射用头孢噻肟钠', '复方白芷酊',
                  '胫腓骨骨折', '西南药业氯霉素片', '宫颈炎', '茶碱缓释胶囊', '原发性硬化性胆管炎', '郑州韩都利肺胶囊', '咽反射消失',
                  '脊髓灰质炎', '甲状腺片', '回盲瓣功能不全', '牛黄清胃丸', '乙肝e抗体', '马齿苋粥', '动脉硬化', '宝宝乐', '肠闭锁', '肺放线菌病',
                  '江苏晨牌产妇安颗粒', '犬吠样咳嗽', '胃康灵胶囊', '小儿烟酸缺乏病', '青龙防风通圣丸', '广东南国维生素C片', '碘化油咀嚼片',
                  '西乐葆', '伟哥甲磺酸酚妥拉明分散片', '成都迪康药业樟脑醑', '斑疹', '五花炖墨鱼', '肉炖芸豆粉条', '陕西东泰制药益脉康胶囊',
                  '桔梗八味颗粒', '华南牌溴丙胺太林片', '吉林敖东洮南小牛脾提取物注', '仁青芒觉', '血吸虫病与肝胆疾病', '持续性枕横位难产',
                  '弯曲菌感染', '丝瓜蘑菇肉片汤', '长春银诺克清咽片', '肝叶萎缩', '迪皿盐酸左西替利嗪口服溶液', '阿司匹林']

    # 建树
    actree = ahocorasick.Automaton()
    for index, word in enumerate(wordlist):
        actree.add_word(word, (index, word))
    actree.make_automaton()

    for i in actree.iter('昨天发烧，服用了阿司匹林,并且还吃了牛黄清胃丸，饭是吃了瓜烧白菜，大便有点色浅'):
        print(i)
